app/controllers/employees_controller.rb

INSERT INTO "employees" ("first_name", "last_name", "job_title", "salary", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    Employee.create employee_params

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @employee = Employee.find params[:id]

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    employee = Employee.find params[:id]

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @employee = Employee.find params[:id]

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 5]]
---
  def destroy
    @employee = Employee.find params[:id]
    @employee.destroy